def fourth_task():
	'''
	4. Представлен список чисел. Определите элементы списка,
	не имеющие повторений. Сформируйте итоговый массив чисел,
	соответствующих требованию. Элементы выведите в порядке их
	следования в исходном списке.
	Для выполнения задания обязательно используйте генератор.

	Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
	Результат: [23, 1, 3, 10, 4, 11]
	'''
	num_list = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
	print('иходный список: ', num_list)
	res_list = (item for item in num_list if num_list.count(item) == 1)
	print('результирующий список: ', list(res_list))
	return


if __name__ == '__main__':
	try:
		fourth_task()
	except KeyboardInterrupt:
		print('\n\nВы нажали Cntl + C\nпроцесс завершен!\n')
		exit()
